espruino/Espruino/targets/stm32_ll/jshardware.c
void jshSetAFPin(GPIO_TypeDef* port, uint16_t pin, uint8_t af) {
  if(pin >= LL_GPIO_PIN_0 && pin <=LL_GPIO_PIN_7){
    LL_GPIO_SetAFPin_0_7(port, pin, af);
  } else {
    LL_GPIO_SetAFPin_8_15(port, pin, af);
  }
  LL_GPIO_SetPinMode(port, pin, LL_GPIO_MODE_ALTERNATE);

}

static uint64_t DEVICE_INITIALISED_FLAGS = 0L;

/** Is the given device initialised?
 * eg. has jshUSARTSetup/jshI2CSetup/jshSPISetup been called previously? */
bool jshIsDeviceInitialised(IOEventFlags device) {
  uint64_t mask = 1ULL << (int)device;
  return (DEVICE_INITIALISED_FLAGS & mask) != 0L;
}

void jshSetDeviceInitialised(IOEventFlags device, bool isInit) {
  uint64_t mask = 1ULL << (int)device;
  if (isInit) {
    DEVICE_INITIALISED_FLAGS |= mask;
  } else {
    DEVICE_INITIALISED_FLAGS &= ~mask;
  }
}

USART_TypeDef* getUsartFromDevice(IOEventFlags device) {
 switch (device) {
   case EV_SERIAL1 : return USART1;
   case EV_SERIAL2 : return USART2;
#if USART_COUNT>=3
   case EV_SERIAL3 : return USART3;
#endif
#if USART_COUNT>=4
   case EV_SERIAL4 : return UART4;
#endif
#if USART_COUNT>=5
   case EV_SERIAL5 : return UART5;
#endif
#if USART_COUNT>=6
   case EV_SERIAL6 : return USART6;
#endif
   default: return 0;
 }
}

void *setDeviceClockCmd(JshPinFunction device, FunctionalState cmd) {
  device = device&JSH_MASK_TYPE;
  void *ptr = 0;
  if (device == JSH_USART1) {
    if(cmd == ENABLE) {
        LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);
        LL_RCC_SetUSARTClockSource(LL_RCC_USART1_CLKSOURCE_PCLK2);
    } else LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_USART1);
    ptr = USART1;
  } else if (device == JSH_USART2) {
    if(cmd == ENABLE) {
        LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2);
        LL_RCC_SetUSARTClockSource(LL_RCC_USART2_CLKSOURCE_PCLK1);
    } else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART2);
    ptr = USART2;
#if defined(USART3) && USART_COUNT>=3
  } else if (device == JSH_USART3) {
    if(cmd == ENABLE) {
      LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3);
      LL_RCC_SetUSARTClockSource(LL_RCC_USART3_CLKSOURCE_PCLK1);
    } else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART3);
    ptr = USART3;
#endif
#if SPI_COUNT >= 1
  } else if (device==JSH_SPI1) {
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_SPI1);
    ptr = SPI1;
#endif
#if SPI_COUNT >= 2
  } else if (device==JSH_SPI2) {
    if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2);
    else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_SPI2);
    ptr = SPI2;
#endif
#if SPI_COUNT >= 3
  } else if (device==JSH_SPI3) {
    if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI3);
    else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_SPI3);
    ptr = SPI3;
#endif
#if I2C_COUNT >= 1
  } else if (device==JSH_I2C1) {
      if(cmd == ENABLE) {
        LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);
        LL_RCC_SetI2CClockSource(LL_RCC_I2C1_CLKSOURCE_SYSCLK); // What's happen if we don't specify this ?
      } else {
        LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_I2C1);
      }
      /* Seems some F103 parts require this reset step - some hardware problem */
      //LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_I2C1);
      //LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C1);
      ptr = I2C1;
#endif
#if I2C_COUNT >= 2
  } else if (device==JSH_I2C2) {
      if(cmd == ENABLE) {
        LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C2);
        LL_RCC_SetI2CClockSource(LL_RCC_I2C2_CLKSOURCE_SYSCLK);
      } else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_I2C2);
      /* Seems some F103 parts require this reset step - some hardware problem */
      //LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_I2C2);
      //LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C2);
      ptr = I2C2;
#endif
#if I2C_COUNT >= 3
  } else if (device==JSH_I2C3) {
      if(cmd == ENABLE) {
        LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C3);
        LL_RCC_SetI2CClockSource(LL_RCC_I2C3_CLKSOURCE_SYSCLK);
      } else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_I2C3);
      /* Seems some F103 parts require this reset step - some hardware problem */
      //LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_I2C3);
      //LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C3);
      ptr = I2C3;
#endif
  } else if (device==JSH_TIMER1) {
    ptr = TIM1;
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM1);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM1);
  } else if (device==JSH_TIMER2)  {
    ptr = TIM2;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM2);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM2);
  } else if (device==JSH_TIMER3)  {
    ptr = TIM3;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM3);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM3);
  } else if (device==JSH_TIMER4)  {
    ptr = TIM4;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM4);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM4);
#ifdef TIM5
  } else if (device==JSH_TIMER5) {
    ptr = TIM5;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM5);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM5);
#endif
#ifdef TIM6
  } else if (device==JSH_TIMER6)  { // Not used for outputs
    ptr = TIM6;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM6);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM6);
#endif
#ifdef TIM7
  } else if (device==JSH_TIMER7)  { // Not used for outputs
    ptr = TIM7;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM7);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM7);
#endif
#ifdef TIM8
  } else if (device==JSH_TIMER8) {
    ptr = TIM8;
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM8);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM8);
#endif
#ifdef TIM9
  } else if (device==JSH_TIMER9)  {
    ptr = TIM9;
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM9);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM9);
#endif
#ifdef TIM10
  } else if (device==JSH_TIMER10)  {
    ptr = TIM10;
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM10);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM10);
#endif
#ifdef TIM11
  } else if (device==JSH_TIMER11)  {
    ptr = TIM11;
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM11);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM11);
#endif
#ifdef TIM12
  } else if (device==JSH_TIMER12)  {
    ptr = TIM12;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM12);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM12);
#endif
#ifdef TIM13
  } else if (device==JSH_TIMER13)  {
    ptr = TIM13;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM13);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM13);
#endif
#ifdef TIM14
  } else if (device==JSH_TIMER14)  {
    ptr = TIM14;
      if(cmd == ENABLE) LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM14);
      else LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM14);
#endif
#ifdef TIM15
  } else if (device==JSH_TIMER15)  {
    ptr = TIM15;
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM15);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM15);
#endif
#ifdef TIM16
  } else if (device==JSH_TIMER16)  {
    ptr = TIM16;
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM16);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM16);
#endif
#ifdef TIM17
  } else if (device==JSH_TIMER17)  {
    ptr = TIM17;
    if(cmd == ENABLE)  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM17);
    else  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM17);
#endif
  } else {
    jsExceptionHere(JSET_INTERNALERROR, "setDeviceClockCmd: Unknown Device %d", (int)device);
  }
  return ptr;
}

SPI_TypeDef* getSPIFromDevice(IOEventFlags device) {
 switch (device) {
   case EV_SPI1 : return SPI1;
   case EV_SPI2 : return SPI2;
   case EV_SPI3 : return SPI3;
   default: return 0;
 }
}

I2C_TypeDef* getI2CFromDevice(IOEventFlags device) {
 switch (device) {
   case EV_I2C1 : return I2C1;
   case EV_I2C2 : return I2C2;
#ifdef I2C3
   case EV_I2C3 : return I2C3;
#endif
   default: return 0;
 }
}

/// Set the pin state (Output, Input, etc)
ALWAYS_INLINE void jshPinSetState(Pin pin, JshPinState state) {
  /* Make sure we kill software PWM if we set the pin state
   * after we've started it */
  if (BITFIELD_GET(jshPinSoftPWM, pin)) {
    BITFIELD_SET(jshPinSoftPWM, pin, 0);
    jstPinPWM(0,0,pin);
  }

  LL_GPIO_InitTypeDef GPIO_InitStructure;
  bool out = JSHPINSTATE_IS_OUTPUT(state);
  /* bool af = JSHPINSTATE_IS_AF(state);
   * af function cannot be configured here because we do not know the af
   * name... It should be done on the caller of jshPinSetState 
   * (This is due to a difference between SPL and LL libraries) */
  bool pullup = JSHPINSTATE_IS_PULLUP(state);
  bool pulldown = JSHPINSTATE_IS_PULLDOWN(state);
  bool opendrain = JSHPINSTATE_IS_OPENDRAIN(state);

  if (out) {
    if (state==JSHPINSTATE_DAC_OUT) GPIO_InitStructure.Mode = LL_GPIO_MODE_ANALOG;
    else GPIO_InitStructure.Mode = LL_GPIO_MODE_OUTPUT;
    GPIO_InitStructure.OutputType = opendrain ? LL_GPIO_OUTPUT_OPENDRAIN : LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  } else {
    GPIO_InitStructure.Mode = LL_GPIO_MODE_INPUT;
    if (state==JSHPINSTATE_ADC_IN) GPIO_InitStructure.Mode = LL_GPIO_MODE_ANALOG;
  }
  GPIO_InitStructure.Pull = pulldown ? LL_GPIO_PULL_DOWN : (pullup ? LL_GPIO_PULL_UP : LL_GPIO_PULL_NO);
  GPIO_InitStructure.Pin = stmPin(pin);
  LL_GPIO_Init(stmPort(pin), &GPIO_InitStructure);
}

/** Get the pin state (only accurate for simple IO - won't return
 * JSHPINSTATE_USART_OUT for instance). Note that you should use
 * JSHPINSTATE_MASK as other flags may have been added
 * (like JSHPINSTATE_PIN_IS_ON if pin was set to output) */
JshPinState jshPinGetState(Pin pin) {
  GPIO_TypeDef* port = stmPort(pin);
  uint16_t pinn = stmPin(pin);
  int pinNumber = pinInfo[pin].pin;
  bool isOn = (port->ODR&pinn) != 0;
  int mode = (port->MODER >> (pinNumber*2)) & 3;
  if (mode==0) { // input
    int pupd = (port->PUPDR >> (pinNumber*2)) & 3;
    if (pupd==1) return JSHPINSTATE_GPIO_IN_PULLUP;
    if (pupd==2) return JSHPINSTATE_GPIO_IN_PULLDOWN;
    return JSHPINSTATE_GPIO_IN;
  } else if (mode==1) { // output
    return ((port->OTYPER&pinn) ? JSHPINSTATE_GPIO_OUT_OPENDRAIN : JSHPINSTATE_GPIO_OUT) |
            (isOn ? JSHPINSTATE_PIN_IS_ON : 0);
  } else if (mode==2) { // AF
    return (port->OTYPER&pinn) ? JSHPINSTATE_AF_OUT_OPENDRAIN : JSHPINSTATE_AF_OUT;
  } else { // 3, analog
    return JSHPINSTATE_ADC_IN;
  }
  // LL_GPIO_IsOutputPinSet(port, pinn);
}

static NO_INLINE void jshPinSetFunction(Pin pin, JshPinFunction func) {
  if (JSH_PINFUNCTION_IS_USART(func)) {
    if ((func&JSH_MASK_INFO)==JSH_USART_RX)
      jshPinSetState(pin, JSHPINSTATE_USART_IN);
    else
      jshPinSetState(pin,JSHPINSTATE_USART_OUT);
  } else if (JSH_PINFUNCTION_IS_I2C(func)) {
    jshPinSetState(pin, JSHPINSTATE_I2C);
  } else {
    bool opendrain = JSHPINSTATE_IS_OPENDRAIN(jshPinGetState(pin)&JSHPINSTATE_MASK);
    jshPinSetState(pin, opendrain ? JSHPINSTATE_AF_OUT_OPENDRAIN : JSHPINSTATE_AF_OUT); // otherwise general AF out!
  }
  // now 'connect' the pin up
  jshSetAFPin(stmPort(pin), stmPin(pin), functionToAF(func));
}


