espruino/Espruino/targets/stm32_ll/jshardware.c
  data[ 0] = (unsigned char)((addr[0]      ) & 0xFF);
  data[ 1] = (unsigned char)((addr[0] >>  8) & 0xFF);
  data[ 2] = (unsigned char)((addr[0] >> 16) & 0xFF);
  data[ 3] = (unsigned char)((addr[0] >> 24) & 0xFF);
  data[ 4] = (unsigned char)((addr[1]      ) & 0xFF);
  data[ 5] = (unsigned char)((addr[1] >>  8) & 0xFF);
  data[ 6] = (unsigned char)((addr[1] >> 16) & 0xFF);
  data[ 7] = (unsigned char)((addr[1] >> 24) & 0xFF);
  data[ 8] = (unsigned char)((addr[2]      ) & 0xFF);
  data[ 9] = (unsigned char)((addr[2] >>  8) & 0xFF);
  data[10] = (unsigned char)((addr[2] >> 16) & 0xFF);
  data[11] = (unsigned char)((addr[2] >> 24) & 0xFF);
  return 12;
}


/** Is the USB port connected such that we could move the console over to it
 * (and that we should store characters sent to USB). On non-USB boards this just returns false. */
bool jshIsUSBSERIALConnected(){
#ifdef USB
  return USB_IsConnected();
#else
  return false;
#endif
}


/** The system time is used all over Espruino - for:
 *  * setInterval/setTimeout
 *  * new Date()
 *  * getTime
 *  * scheduling the utility timer (digitalPulse/Waveform/etc)
 *  * timestamping watches (so measuring pulse widths)
 *
 * It is time since 1970 - in whatever units make sense for the platform. For real-time
 * platforms units should really be at the uS level. Often this timer directly counts
 * clock cycles with the SysTick timer.
 */

/// Get the system time (in ticks since the epoch)
JsSysTime jshGetSystemTime(){
  JsSysTime major1, major2, major3, major4;
  unsigned int minor;
  do {
    major1 = SysTickMajor;
    major2 = SysTickMajor;
    minor = SysTick->VAL;
    major3 = SysTickMajor;
    major4 = SysTickMajor;
  } while (major1!=major2 || major2!=major3 || major3!=major4);
  return major1 - (JsSysTime)minor;
}

/** Set the system time (in ticks since the epoch) - this should only be called rarely as it
could mess up things like jsinteractive's timers! */
void jshSetSystemTime(JsSysTime newTime){
  jshInterruptOff();
  SysTickMajor = newTime;
  jshInterruptOn();
  jshGetSystemTime(); // force update of the time

}


static JsSysTime jshGetTimeForSecond() {
  return (JsSysTime)getSystemTimerFreq();
}

/// Convert a time in Milliseconds since the epoch to one in ticks
JsSysTime jshGetTimeFromMilliseconds(JsVarFloat ms){
  return (JsSysTime)((ms*(JsVarFloat)jshGetTimeForSecond())/1000);
}

/// Convert ticks to a time in Milliseconds since the epoch
JsVarFloat jshGetMillisecondsFromTime(JsSysTime time){
  return ((JsVarFloat)time)*1000/(JsVarFloat)jshGetTimeForSecond();
}


// software IO functions...
void jshInterruptOff(){
  __disable_irq();
}
///< disable interrupts to allow short delays to be accurate
void jshInterruptOn(){
  __enable_irq();
}
///< re-enable interrupts

/// Are we currently in an interrupt?
bool jshIsInInterrupt() {
  return (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0;
}

void jshDelayMicroseconds(int microsec){
  int iter = (int)(((long long)microsec * (long long)JSH_DELAY_MULTIPLIER) >> 10);
//  iter -= JSH_DELAY_OVERHEAD;
  if (iter<0) iter=0;
  while (iter--) __NOP();
}
///< delay a few microseconds. Should use used sparingly and for very short periods - max 1ms

void jshPinSetValue(Pin pin, bool value){
    if (value)
      LL_GPIO_SetOutputPin(stmPort(pin), stmPin(pin));
    else
      LL_GPIO_ResetOutputPin(stmPort(pin), stmPin(pin));
    return;
}
///< Set a digital output to 1 or 0. DOES NOT change pin state OR CHECK PIN VALIDITY

bool jshPinGetValue(Pin pin){
    return LL_GPIO_IsInputPinSet(stmPort(pin), stmPin(pin)) != 0;
}

// ----------------------------------------------------------------------------


/* defines related to ADC operations
 * (See L4 reference manual and examples for more details) */
//#define ADC_CALIBRATION_TIMEOUT_MS        ((uint32_t)   1)
#define ADC_ENABLE_TIMEOUT_MS             ((uint32_t)   1)
//#define ADC_DISABLE_TIMEOUT_MS            ((uint32_t)   1)
//#define ADC_STOP_CONVERSION_TIMEOUT_MS    ((uint32_t)   1)
//#define ADC_CONVERSION_TIMEOUT_MS         ((uint32_t) 500)

#define ADC_DELAY_CALIB_ENABLE_CPU_CYCLES (LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES * 32) // Delay between ADC end of calibration and ADC enable.

#define VDDA_APPLI                        ((uint32_t)3300) // analog reference voltage in mV (Vref+)
#define ADC_UNITARY_CONVERSION_TIMEOUT_MS ((uint32_t)   1)

static NO_INLINE int jshAnalogRead(Pin pin, JsvPinInfoAnalog analog, bool fastConversion) {
  NOT_USED(fastConversion); // TBC
  int value = 0;
  uint32_t wait_loop_index = 0;
  uint32_t Timeout = 0;
  IRQn_Type adcIRQ;
  ADC_TypeDef *ADCx = stmADC(analog);

#if defined(GPIO_ASCR_ASC0)
  /* For families where Analog Control ASC0 register is present */
  /* Connect GPIO analog switch to ADC input */
  LL_GPIO_EnablePinAnalogControl(stmPort(pin), stmPin(pin));
#endif /* GPIO_ASCR_ASC0 */

  if(ADCx == ADC1 || ADCx == ADC2) {
    adcIRQ = ADC1_2_IRQn;
  }else if(ADCx == ADC3) {
    adcIRQ = ADC3_IRQn;
  }else {
    jsExceptionHere(JSET_INTERNALERROR, "jshAnalogRead: Unknown ADC %d", (int)ADCx);
  }

  NVIC_SetPriority(adcIRQ, 0);
  NVIC_EnableIRQ(adcIRQ);

  LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC);

  /* Set ADC clock (conversion clock) common to several ADC instances */
  LL_ADC_SetCommonClock(__LL_ADC_COMMON_INSTANCE(ADCx), LL_ADC_CLOCK_SYNC_PCLK_DIV2);

  /* Disable ADC deep power down (enabled by default after reset state) */
  LL_ADC_DisableDeepPowerDown(ADCx);

  /* Enable ADC internal voltage regulator */
  LL_ADC_EnableInternalRegulator(ADCx);

  jshDelayMicroseconds(1024*10);

  /* ADC settings */
  LL_ADC_REG_SetSequencerRanks(ADCx, LL_ADC_REG_RANK_1, stmADCChannel(analog));

  /* Enable ADC */
  LL_ADC_Enable(ADCx);

  /* Poll for ADC ready to convert */
  Timeout = ADC_ENABLE_TIMEOUT_MS;

  while (LL_ADC_IsActiveFlag_ADRDY(ADCx) == 0){
    if (LL_SYSTICK_IsActiveCounterFlag()){
      if(Timeout-- == 0){
        jsiConsolePrintf("\n  jshAnalogRead Timeout !!!");
      }
    }
  }

  /* Perform ADC group regular conversion start, poll for conversion        */
  LL_ADC_REG_StartConversion(ADCx);

