espruino/Espruino/targets/stm32_ll/jshardware.c
}

/// Can the given pin be watched? it may not be possible because of conflicts
bool jshCanWatch(Pin pin){
  if (jshIsPinValid(pin)) {
    return watchedPins[pinInfo[pin].pin]==PIN_UNDEFINED;
  } else
    return false;;
}

/// start watching pin - return the EXTI (IRQ number flag) associated with it
IOEventFlags jshPinWatch(Pin pin, bool shouldWatch){
  if (jshIsPinValid(pin)) {
    // TODO: check for DUPs, also disable interrupt
    /*int idx = pinToPinSource(IOPIN_DATA[pin].pin);
    if (pinInterrupt[idx].pin>PININTERRUPTS) jsError("Interrupt already used");
    pinInterrupt[idx].pin = pin;
    pinInterrupt[idx].fired = false;
    pinInterrupt[idx].callbacks = ...;*/

    if (shouldWatch) {
      // set as input
      if (!jshGetPinStateIsManual(pin)){
        jshPinSetState(pin, JSHPINSTATE_GPIO_IN);
      }

      LL_SYSCFG_SetEXTISource(stmPortSource(pin), stmPinSource(pin));
    }
    watchedPins[pinInfo[pin].pin] = (Pin)(shouldWatch ? pin : PIN_UNDEFINED);

    LL_EXTI_InitTypeDef s;
    LL_EXTI_StructInit(&s);
    s.Line_0_31 = stmExtI(pin);
    s.Mode =  LL_EXTI_MODE_IT;
    s.Trigger = LL_EXTI_TRIGGER_RISING_FALLING;
    s.LineCommand = shouldWatch ? ENABLE : DISABLE;
    LL_EXTI_Init(&s);

    return shouldWatch ? (EV_EXTI0+pinInfo[pin].pin)  : EV_NONE;
  } else jsExceptionHere(JSET_ERROR, "Invalid pin!");
  return EV_NONE;
}

/// Check the pin associated with this EXTI - return true if the pin's input is a logic 1
bool jshGetWatchedPinState(IOEventFlags device) {
  int exti = IOEVENTFLAGS_GETTYPE(device) - EV_EXTI0;
  Pin pin = watchedPins[exti];
  if (jshIsPinValid(pin))
    return LL_GPIO_IsInputPinSet(stmPort(pin), stmPin(pin));
  return false;
}

/// Given a Pin, return the current pin function associated with it
JshPinFunction jshGetCurrentPinFunction(Pin pin){
  // FIXME: This isn't actually right - we need to look at the hardware or store this info somewhere.
  if (jshIsPinValid(pin)) {
    int i;
    for (i=0;i<JSH_PININFO_FUNCTIONS;i++) {
      JshPinFunction func = pinInfo[pin].functions[i];
      if (JSH_PINFUNCTION_IS_TIMER(func) ||
          JSH_PINFUNCTION_IS_DAC(func))
        return func;
    }
  }
  return JSH_NOTHING;
}

/** Given a pin function, set that pin to the 16 bit value
 * (used mainly for fast DAC and PWM handling from Utility Timer) */
void jshSetOutputValue(JshPinFunction func, int value){
        return;
}


/// Enable watchdog with a timeout in seconds, it should be reset from `jshIdle`
void jshEnableWatchDog(JsVarFloat timeout){
        return;
}

// Kick the watchdog
void jshKickWatchDog(void){
        return;
}


/// Given an event, check the EXTI flags and see if it was for the given pin
bool jshIsEventForPin(IOEvent *event, Pin pin){
  return IOEVENTFLAGS_GETTYPE(event->flags) == pinToEVEXTI(pin);
}


/** Kick a device into action (if required). For instance we may have data ready
 * to sent to a USART, but we need to enable the IRQ such that it can automatically
 * fetch the characters to send.
 *
 * Later down the line this could potentially even set up something like DMA.*/
void jshUSARTKick(IOEventFlags device){

  USART_TypeDef *uart = getUsartFromDevice(device);
  if (uart && !jshIsDeviceInitialised(device)) {
    JshUSARTInfo inf;
    jshUSARTInitInfo(&inf);
    jshUSARTSetup(device, &inf);
  }

  if (uart)  LL_USART_EnableIT_TXE(uart );

}

static unsigned int jshGetSPIFreq(SPI_TypeDef *SPIx) {
  LL_RCC_ClocksTypeDef clocks;
  LL_RCC_GetSystemClocksFreq(&clocks);
  bool APB2 = SPIx == SPI1;
  return APB2 ? clocks.PCLK2_Frequency : clocks.PCLK1_Frequency;
}

/** Set up SPI, if pins are -1 they will be guessed */
void jshSPISetup(IOEventFlags device, JshSPIInfo *inf){
  jshSetDeviceInitialised(device, true);
  JshPinFunction funcType = jshGetPinFunctionFromDevice(device);

  enum {pinSCK, pinMISO, pinMOSI};
  Pin pins[3] = { inf->pinSCK, inf->pinMISO, inf->pinMOSI };
  JshPinFunction functions[3] = { JSH_SPI_SCK, JSH_SPI_MISO, JSH_SPI_MOSI };
  SPI_TypeDef *SPIx = (SPI_TypeDef *)checkPinsForDevice(funcType, 3, pins, functions);
  if (!SPIx) return; // failed to find matching pins

  LL_SPI_InitTypeDef LL_SPI_InitStructure;
  LL_SPI_InitStructure.TransferDirection = LL_SPI_FULL_DUPLEX;
  LL_SPI_InitStructure.DataWidth = LL_SPI_DATAWIDTH_8BIT;
  LL_SPI_InitStructure.ClockPolarity = (inf->spiMode&SPIF_CPOL)?LL_SPI_POLARITY_HIGH:LL_SPI_POLARITY_LOW;
  LL_SPI_InitStructure.ClockPhase = (inf->spiMode&SPIF_CPHA)?LL_SPI_PHASE_2EDGE:LL_SPI_PHASE_1EDGE;
  LL_SPI_InitStructure.NSS = LL_SPI_NSS_SOFT;
  LL_SPI_InitStructure.BitOrder = inf->spiMSB ? LL_SPI_MSB_FIRST : LL_SPI_LSB_FIRST;
  LL_SPI_InitStructure.CRCPoly = 7;
  LL_SPI_InitStructure.Mode = LL_SPI_MODE_MASTER;
  LL_SPI_InitStructure.CRCCalculation = LL_SPI_CRCCALCULATION_DISABLE;
  // try and find the best baud rate
  unsigned int spiFreq = jshGetSPIFreq(SPIx);
  const unsigned int baudRatesDivisors[] = { 2,4,8,16,32,64,128,256 };
  const uint16_t baudRatesIds[] = { LL_SPI_BAUDRATEPRESCALER_DIV2,LL_SPI_BAUDRATEPRESCALER_DIV4,
      LL_SPI_BAUDRATEPRESCALER_DIV8,LL_SPI_BAUDRATEPRESCALER_DIV16,LL_SPI_BAUDRATEPRESCALER_DIV32,
      LL_SPI_BAUDRATEPRESCALER_DIV64,LL_SPI_BAUDRATEPRESCALER_DIV128,LL_SPI_BAUDRATEPRESCALER_DIV256 };
  int bestDifference = 0x7FFFFFFF;
  unsigned int i;
  for (i=0;i<sizeof(baudRatesDivisors)/sizeof(unsigned int);i++) {
    unsigned int rate = spiFreq / baudRatesDivisors[i];

    int rateDiff = inf->baudRate - (int)rate;
    if (rateDiff<0) rateDiff *= -1;

    // if this is outside what we want, make sure it's considered a bad choice
    if (inf->baudRateSpec==SPIB_MAXIMUM && rate > (unsigned int)inf->baudRate) rateDiff += 0x10000000;
    if (inf->baudRateSpec==SPIB_MINIMUM && rate < (unsigned int)inf->baudRate) rateDiff += 0x10000000;

    if (rateDiff < bestDifference) {
      bestDifference = rateDiff;
      LL_SPI_InitStructure.BaudRate = baudRatesIds[i];
    }
  }

  uint8_t spiIRQ;
  switch (device) {
    case EV_SPI1: spiIRQ = SPI1_IRQn; break;
    case EV_SPI2: spiIRQ = SPI2_IRQn; break;
#if SPI_COUNT>=3
    case EV_SPI3: spiIRQ = SPI3_IRQn; break;
#endif
    default: assert(0); break;
  }

  // Enable SPI interrupt
  NVIC_SetPriority(spiIRQ, IRQ_PRIOR_SPI);
  NVIC_EnableIRQ(spiIRQ);

  // Set the threshold to have an RXNE event every bytes
  LL_SPI_SetRxFIFOThreshold(SPIx, LL_SPI_RX_FIFO_TH_QUARTER);
  // Enable RX interrupt (No TX IRQ wanted)
  LL_SPI_EnableIT_RXNE(SPIx);

