espruino/Espruino/targets/stm32_ll/jshardware.c
  /* Enable SPI  */
  LL_SPI_Init(SPIx, &LL_SPI_InitStructure);
  LL_SPI_Enable(SPIx );
}

// push a byte into SPI buffers (called from IRQ)
void jshSPIPush(IOEventFlags device, uint16_t data) {
  int n = device-EV_SPI1;
  jshSPIBuf[n][jshSPIBufHead[n]] = (unsigned char)data;
  jshSPIBufHead[n] = (jshSPIBufHead[n]+1)&JSH_SPIBUF_MASK;
}

/** Send data through the given SPI device (if data>=0), and return the result
 * of the previous send (or -1). If data<0, no data is sent and the function
 * waits for data to be returned */
int jshSPISend(IOEventFlags device, int data){
  int n = device-EV_SPI1;
  SPI_TypeDef *SPI = getSPIFromDevice(device);

  /* Loop while DR register in not empty */
  WAIT_UNTIL(LL_SPI_IsActiveFlag_TXE(SPI) != RESET, "SPI TX");

  if (data >= 0) {
    /* Send a Byte through the SPI peripheral */
    LL_SPI_TransmitData8(SPI, (uint8_t)data);
  } else {
    // we were actually waiting for a byte to receive - let's hope we get it!
    //jsiConsolePrintf("\n> jshSPISend : wait for reception");
    WAIT_UNTIL(jshSPIBufHead[n]!=jshSPIBufTail[n], "SPI RX");
  }

  /* Return the Byte read from the SPI bus - or -1 if no byte */
  if (jshSPIBufHead[n]!=jshSPIBufTail[n]) {
    int data = jshSPIBuf[n][jshSPIBufTail[n]];
    jshSPIBufTail[n] = (jshSPIBufTail[n]+1)&JSH_SPIBUF_MASK;
    return data;
  } else {
    return -1;
  }
}

/** Send 16 bit data through the given SPI device. */
void jshSPISend16(IOEventFlags device, int data){
   SPI_TypeDef *SPI = getSPIFromDevice(device);

  /* Loop while DR register in not empty */
  WAIT_UNTIL(LL_SPI_IsActiveFlag_TXE(SPI) != RESET, "SPI TX");

  /* Send a Byte through the SPI peripheral */
  LL_SPI_TransmitData16(SPI, (uint16_t)data);
}

/** Set whether to send 16 bits or 8 over SPI */
void jshSPISet16(IOEventFlags device, bool is16){
  SPI_TypeDef *SPI = getSPIFromDevice(device);
  jsiConsolePrintf("> jshSPISet16 is16=%d", is16);
  /* Loop until not sending */
  WAIT_UNTIL(LL_SPI_IsActiveFlag_BSY(SPI ) != SET, "SPI BSY");
  /* Set the data size */
  LL_SPI_SetDataWidth(SPI, is16 ? LL_SPI_DATAWIDTH_16BIT : LL_SPI_DATAWIDTH_8BIT);
  /* Set the threshold for RXNE events */
  LL_SPI_SetRxFIFOThreshold(SPI, is16 ? LL_SPI_RX_FIFO_TH_HALF : LL_SPI_RX_FIFO_TH_QUARTER);
}

/** Set whether to use the receive interrupt or not */
void jshSPISetReceive(IOEventFlags device, bool isReceive){
  SPI_TypeDef *SPI = getSPIFromDevice(device);
  /* Loop until not sending */
  WAIT_UNTIL(LL_SPI_IsActiveFlag_BSY(SPI ) != SET, "SPI BSY");
  /* Set receive state */
  if(isReceive){
    LL_SPI_EnableIT_RXNE(SPI);
  } else {
    LL_SPI_DisableIT_RXNE(SPI);
  }
}

/** Wait until SPI send is finished, and flush all received data */
void jshSPIWait(IOEventFlags device){
  int n = device-EV_SPI1;
  SPI_TypeDef *SPI = getSPIFromDevice(device);
  /* Loop until not sending */
  WAIT_UNTIL(LL_SPI_IsActiveFlag_BSY(SPI ) != SET, "SPI BSY");
  /* Clear SPI receive buffer */
  jshSPIBufTail[n] = jshSPIBufHead[n];
  /* Just in case we didn't have IRQs, and the register was full... */
  LL_SPI_ReceiveData8(SPI);
}

/** Set up I2C, if pins are -1 they will be guessed */
void jshI2CSetup(IOEventFlags device, JshI2CInfo *inf){
  jshSetDeviceInitialised(device, true);
  JshPinFunction funcType = jshGetPinFunctionFromDevice(device);

  enum {pinSCL, pinSDA };
  Pin pins[2] = { inf->pinSCL, inf->pinSDA };
  JshPinFunction functions[2] = { JSH_I2C_SCL, JSH_I2C_SDA };
  I2C_TypeDef *I2Cx = (I2C_TypeDef *)checkPinsForDevice(funcType, 2, pins, functions);
  if (!I2Cx) return;

  LL_I2C_Disable(I2Cx);

  LL_I2C_SetTiming(I2Cx, 0x00F02B86);

  LL_I2C_Enable(I2Cx);
}

/** Write a number of btes to the I2C device. Addresses are 7 bit - that is, between 0 and 0x7F.
 *  sendStop is whether to send a stop bit or not */
void jshI2CWrite(IOEventFlags device, unsigned char address, int nBytes, const unsigned char *data, bool sendStop){

  I2C_TypeDef *I2C = getI2CFromDevice(device);

  LL_I2C_HandleTransfer(I2C, (unsigned char)(address << 1), LL_I2C_ADDRSLAVE_7BIT, (uint32_t)nBytes, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_WRITE);

  while(!LL_I2C_IsActiveFlag_STOP(I2C))
  {
    /* Transmit data (TXIS flag raised) */

    /* Check TXIS flag value in ISR register */
    if(LL_I2C_IsActiveFlag_TXIS(I2C))
    {
      /* Write data in Transmit Data register.
      TXIS flag is cleared by writing data in TXDR register */
      LL_I2C_TransmitData8(I2C, (*data++));

    }
  }

  LL_I2C_ClearFlag_STOP(I2C);

  return;
}

/** Read a number of bytes from the I2C device. */
void jshI2CRead(IOEventFlags device, unsigned char address, int nBytes, unsigned char *data, bool sendStop){
  int i = 0;
  I2C_TypeDef *I2C = getI2CFromDevice(device);

  LL_I2C_HandleTransfer(I2C, (unsigned char)(address << 1), LL_I2C_ADDRSLAVE_7BIT, (uint32_t)nBytes, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_READ);

  while(!LL_I2C_IsActiveFlag_STOP(I2C)) {
    /* Receive data (RXNE flag raised) */

    /* Check RXNE flag value in ISR register */
    if(LL_I2C_IsActiveFlag_RXNE(I2C))
    {
      /* Read character in Receive Data register.
      RXNE flag is cleared by reading data in RXDR register */
      data[i++] = LL_I2C_ReceiveData8(I2C);
    }
  }
  LL_I2C_ClearFlag_STOP(I2C);

  return;
}

/** Return start address and size of the flash page the given address resides in. Returns false if
  * the page is outside of the flash address range */
bool jshFlashGetPage(uint32_t addr, uint32_t *startAddr, uint32_t *pageSize){
  if (addr<FLASH_START ||
      addr>=FLASH_START+FLASH_TOTAL)
    return false;
  if (startAddr) *startAddr = addr & (uint32_t)~(FLASH_PAGE_SIZE-1);
  if (pageSize) *pageSize = FLASH_PAGE_SIZE;
  return true;
}

/** Return a JsVar array containing objects of the form `{addr, length}` for each contiguous block of free
 * memory available. These should be one complete pages, so that erasing the page containing any address in
 * this block won't erase anything useful! */
static void addFlashArea(JsVar *jsFreeFlash, uint32_t addr, uint32_t length) {
  JsVar *jsArea = jsvNewObject();
  if (!jsArea) return;
  jsvObjectSetChildAndUnLock(jsArea, "addr", jsvNewFromInteger((JsVarInt)addr));
  jsvObjectSetChildAndUnLock(jsArea, "length", jsvNewFromInteger((JsVarInt)length));
  jsvArrayPushAndUnLock(jsFreeFlash, jsArea);
}

