espruino/Espruino/targets/stm32_ll/jshardware.c
JsVar *jshFlashGetFree(){
  JsVar *jsFreeFlash = jsvNewEmptyArray();
  if (!jsFreeFlash) return 0;

  // Try and find the page after the end of firmware
  extern int LINKER_ETEXT_VAR; // end of flash text (binary) section
  uint32_t firmwareEnd = FLASH_START | (uint32_t)&LINKER_ETEXT_VAR;
  uint32_t pAddr, pSize;
  jshFlashGetPage(firmwareEnd, &pAddr, &pSize);
  firmwareEnd = pAddr+pSize;
  if (firmwareEnd < FLASH_SAVED_CODE_START)
    addFlashArea(jsFreeFlash, firmwareEnd, FLASH_SAVED_CODE_START-firmwareEnd);

  // Otherwise add undocumented memory
  addFlashArea(jsFreeFlash, FLASH_SAVED_CODE_START, FLASH_SAVED_CODE_LENGTH);

  return jsFreeFlash;

}

/**
  * @brief  Gets the bank of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The bank of a given address
  */
static uint32_t GetBank(uint32_t Addr){
  uint32_t bank = 0;
  if (READ_BIT(SYSCFG->MEMRMP, SYSCFG_MEMRMP_FB_MODE) == 0){
    /* No Bank swap */
    if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)){
      bank = FLASH_BANK_1;
    } else{
      bank = FLASH_BANK_2;
    }
  } else{
    /* Bank swap */
    if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)){
      bank = FLASH_BANK_2;
    } else{
      bank = FLASH_BANK_1;
    }
  }

  return bank;
}

/**
  * @brief  Gets the page of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The page of a given address
  */
static uint32_t GetPage(uint32_t Addr){
  uint32_t page = 0;

  if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)){
    /* Bank 1 */
    page = (Addr - FLASH_BASE) / FLASH_PAGE_SIZE;
  } else {
    /* Bank 2 */
    page = (Addr - (FLASH_BASE + FLASH_BANK_SIZE)) / FLASH_PAGE_SIZE;
  }

  return page;
}

/// Erase the flash page containing the address
void jshFlashErasePage(uint32_t addr){
  static FLASH_EraseInitTypeDef EraseInitStruct;
  uint32_t bank = GetBank(addr);
  uint32_t page = GetPage(addr);
  uint32_t PAGEError = 0;

  HAL_FLASH_Unlock();

  // Clear All pending flags
  //__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | /*FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR*/);

  EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
  EraseInitStruct.Banks       = bank;
  EraseInitStruct.Page        = page;
  EraseInitStruct.NbPages     = 1;

  HAL_StatusTypeDef res = HAL_FLASHEx_Erase(&EraseInitStruct, &PAGEError);
  if( res != HAL_OK){
    jsExceptionHere(JSET_INTERNALERROR, "Flash Erase Error %d", res);
  }

  HAL_FLASH_Lock();

}

/** Read data from flash memory into the buffer, the flash address has no alignment restrictions
  * and the len may be (and often is) 1 byte */
void jshFlashRead(void *buf, uint32_t addr, uint32_t len) {
  memcpy(buf, (void*)addr, len);
}

static void jshFlashWrite64(uint64_t data, uint32_t addr) {
  assert(!(addr&7));
  //jsiConsolePrintf("Write 0x%08x%08x to 0x%08x\n", (uint32_t)(data>>32),(uint32_t)data, addr);
  HAL_StatusTypeDef res = HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr, data);
  if(res != HAL_OK){
    // see HAL_FLASH_GetError for info on error codes
    jsExceptionHere(JSET_INTERNALERROR, "Flash Write Error %d,0x%x (0x%08x)", res, HAL_FLASH_GetError(), addr);
  }
}

/** Write data to flash memory from the buffer, the buffer address and flash address are
  * guaranteed to be 4-byte aligned, and length is a multiple of 4.  */
void jshFlashWrite(void *buf, uint32_t addr, uint32_t len) {
  char *cbuf = (char*)buf;
  assert(!(addr&3));
  assert(!(len&3));

  HAL_FLASH_Unlock();
  // bodge up single 32 bit writes
  if (addr&4) {
    addr -= 4;
    char buf64[8];
    jshFlashRead(&buf64[0],addr,4);
    memcpy(&buf64[4], cbuf, 4);
    jshFlashWrite64(*((uint64_t*)buf64), addr);
    cbuf += 4;
    addr += 8;
    len -= 4;
  }

  // 64 bit writes
  while (len>7 && !jspIsInterrupted()) {
    jshFlashWrite64(*((uint64_t*)cbuf), addr);
    cbuf += 8;
    addr += 8;
    len -= 8;
  }

  // final 32 bit write?
  if (len>3 && !jspIsInterrupted()) {
    char buf64[8];
    memcpy(&buf64[0], cbuf, 4);
    jshFlashRead(&buf64[4],addr+4,4);
    jshFlashWrite64(*((uint64_t*)buf64), addr);
  }

  HAL_FLASH_Lock();
}

// Just pass data through, since we can access flash at the same address we wrote it
size_t jshFlashGetMemMapAddress(size_t ptr) { return ptr; }


/** Utility timer handling functions
 *  ------------------------------------------
 * The utility timer is intended to generate an interrupt and then call jstUtilTimerInterruptHandler
 * as interrupt handler so Espruino can process tasks that are queued up on the timer. Typical
 * functions used in the interrupt handler include reading/write GPIO pins, reading analog and
 * writing analog. See jstimer.c for the implementation.
 *
 * These are exposed through functions like `jsDigitalPulse`, `analogWrite(..., {soft:true})`
 * and the `Waveform` class.
 */

unsigned int jshGetTimerFreq(TIM_TypeDef *TIMx) {
  // TIM2-7, 12-14  on APB1, everything else is on APB2
  LL_RCC_ClocksTypeDef clocks;
  LL_RCC_GetSystemClocksFreq(&clocks);

  // This (oddly) looks the same on F1/2/3/4. It's probably not
  bool APB1 = TIMx==TIM2 || TIMx==TIM3 || TIMx==TIM4 ||
#ifndef STM32F3
              TIMx==TIM5 ||
#endif
#ifdef TIM6
              TIMx==TIM6 ||
#endif
#ifdef TIM7
              TIMx==TIM7 ||
#endif
#ifdef TIM12
              TIMx==TIM12 ||
#endif
#ifdef TIM13
              TIMx==TIM13 ||
#endif
#ifdef TIM14
              TIMx==TIM14 ||
#endif
              false;

  unsigned int freq = APB1 ? clocks.PCLK1_Frequency : clocks.PCLK2_Frequency;
  // If APB1 clock divisor is 1x, this is only 1x
  if (clocks.HCLK_Frequency == freq)
    return freq;
  // else it's 2x (???)
  return freq*2;
}

static NO_INLINE void jshUtilTimerGetPrescale(JsSysTime period, unsigned int *prescale, unsigned int *ticks) {
  unsigned int timerFreq = jshGetTimerFreq(UTIL_TIMER);
  if (period<0) period=0;
  unsigned long long clockTicksL = (timerFreq * (unsigned long long)period) / (unsigned long long)jshGetTimeForSecond();
  if (clockTicksL>0xFFFFFFFF) clockTicksL=0xFFFFFFFF;
  unsigned int clockTicks = (unsigned int)clockTicksL;
  *prescale = ((unsigned int)clockTicks >> 16); // ensure that maxTime isn't greater than the timer can count to
  *ticks = (unsigned int)(clockTicks/((*prescale)+1));
  if (*ticks<1) *ticks=1;
  if (*ticks>65535) *ticks=65535;
}

/// Start the timer and get it to interrupt once after 'period' (i.e. it should not auto-reload)
void jshUtilTimerStart(JsSysTime period){
  unsigned int prescale, ticks;
  jshUtilTimerGetPrescale(period, &prescale, &ticks);

  /* TIM6 Periph clock enable */
  LL_APB1_GRP1_EnableClock(UTIL_TIMER_APB1);
  //LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM5);

  NVIC_SetPriority(UTIL_TIMER_IRQn, 0);
  NVIC_EnableIRQ(UTIL_TIMER_IRQn);

  /*Timer configuration------------------------------------------------*/
  LL_TIM_DisableIT_UPDATE(UTIL_TIMER );
  LL_TIM_DisableCounter(UTIL_TIMER );

  LL_TIM_InitTypeDef TIM_TimeBaseInitStruct;
  LL_TIM_StructInit(&TIM_TimeBaseInitStruct);
  TIM_TimeBaseInitStruct.Prescaler = (uint16_t)prescale;
  TIM_TimeBaseInitStruct.Autoreload = (uint16_t)ticks;
  LL_TIM_Init(UTIL_TIMER, /*LL_TIM_CHANNEL_CH1 ,*/ &TIM_TimeBaseInitStruct);

  // init will have caused a timer update - clear it
  LL_TIM_ClearFlag_UPDATE(UTIL_TIMER );
  // init interrupts and go
  LL_TIM_EnableIT_UPDATE(UTIL_TIMER );
  LL_TIM_EnableCounter(UTIL_TIMER );  /* enable counter */

